package ua.vald_zx.game.rat.race.card.screen.board.cards

import ua.vald_zx.game.rat.race.card.shared.BoardCard
import ua.vald_zx.game.rat.race.card.shared.SharesType

val chanceCards = mapOf(
    1 to BoardCard.Chance.RandomJob(
        "На товарну залізничну станцію прибув цілий склад із цвяхами, цеглою та цементом. Там завжди потрібні сильні руки, щоб усе це розвантажити!",
        300
    ),
    2 to BoardCard.Chance.RandomJob(
        "Звісно, Новий рік приємніше провести за святковим столом у колі сім’ї, але морозні люди з ялинками платять без рахунку. Чому б не затриматися й не підзаробити?",
        400
    ),
    3 to BoardCard.Chance.RandomJob(
        "На ваш день народження друзі вирішили повторити плитку у ванній, як у вас. Ви допомогли — і вам заплатили за роботу.",
        250
    ),
    4 to BoardCard.Chance.RandomJob(
        "Дайте оголошення про підробіток. На Новий рік багато людей шукають помічників. Ви легко знаходите замовлення та непогано заробляєте.",
        500
    ),
    5 to BoardCard.Chance.RandomJob(
        "Ваш приятель терміново потребує помічника для перекриття даху. Спеціальних навичок не потрібно — лише фізична робота. Ви погоджуєтесь і отримуєте оплату.",
        100
    ),
    6 to BoardCard.Chance.RandomJob(
        "Поруч із вашим будинком розпочалось будівництво. Робітникам терміново потрібна допомога для розвантаження матеріалів. Ви погоджуєтесь і добре підзаробляєте.",
        300
    ),
    7 to BoardCard.Chance.RandomJob(
        "Ваша сусідка живе одна, без чоловіка, і звернулася до вас по допомогу. Кожного дня вона просить то молоток, то дриль. Ви допомагаєте їй по-сусідськи, розуміючи, що за це отримаєте оплату. Але ні — вона виявилася касиркою і платити не збирається!",
        300
    ),
    8 to BoardCard.Chance.RandomJob(
        "Случайный заработок: Ви їхали трасою і побачили поламану машину. Водій просить дотягнути його до найближчого міста.",
        100
    ),
    9 to BoardCard.Chance.RandomJob(
        "Случайный заработок: Вам пропонують на вихідних поклеїти оголошення у своєму районі.",
        100
    ),
    10 to BoardCard.Chance.RandomJob(
        "Случайный заработок: Ваш знайомий їде на переговори в США. Йому потрібен перекладач. Ви знаєте англійську мову? Запропонуйте свою кандидатуру! Заодно і світ побачите.",
        200
    ),
    11 to BoardCard.Chance.RandomJob(
        "Случайный заработок: Далеко від вашого району є котеджне містечко з басейнами. Самі вони за чистоту не беруться, але платять за брудну роботу дуже добре.",
        300
    ),
    12 to BoardCard.Chance.RandomJob(
        "Ваша ЖК шукає альпіністів, щоб утеплити стіни житлового будинку. Ви допомогли організувати роботи, подолали страх висоти — і добре заробили.",
        500
    ),
    13 to BoardCard.Chance.RandomJob(
        "Ваші сусіди вивішують на місяць свій гараж під майстерню з лазерною різкою. Ви організували показ — безкоштовно. Надієтесь, що віддячать.",
        150
    ),
    14 to BoardCard.Chance.RandomJob(
        "Вас запросили взяти участь у телевізійному шоу «Одна сім’я — один мільйон». Ви не виграли головний приз, але гонорар отримали.",
        200
    ),
    15 to BoardCard.Chance.RandomJob(
        "Вам пропонують на вихідних рознести рекламні листівки по поштових скриньках свого району.",
        100
    ),
    16 to BoardCard.Chance.Land(
        "Поруч із містом, у живописному місці, продається пустир площею 6 соток. Власник отримав його у спадок, тому продає буквально за копійки.",
        1800, 6, 300, 10
    ),
    17 to BoardCard.Chance.Land(
        "Ви під’їхали до міста й побачили занедбаний пустир. Його власник готовий продати ділянку за безцінь. Можливо, це саме те, що ви шукали?",
        45000, 30, 1500, 10
    ),
    18 to BoardCard.Chance.Land(
        "У 15-кілометровій зоні від міста продається ділянка площею 12 соток із дозволом на забудову. Скористайтеся вигідною пропозицією!",
        9000, 12, 750, 10
    ),
    19 to BoardCard.Chance.Land(
        "Ви їхали трасою й побачили згорілий будинок із зарослою ділянкою у 12 соток. Сам будинок відновленню не підлягає, тому продається як земельна ділянка, яку легко купити.",
        7200, 12, 600, 10
    ),
    20 to BoardCard.Chance.Land(
        "Вам пропонують вигідно вступити в дачний кооператив і взяти участь у розширенні ділянки із можливістю подальшої приватизації.",
        3500, 10, 350, 10
    ),
    21 to BoardCard.Chance.Land(
        "У добре розвиненому ПГТ неподалік від міста продається ділянка під індивідуальну забудову. Поряд — школа, лікарня, транспорт.",
        6000, 12, 500, 10
    ),
    22 to BoardCard.Chance.Land(
        "Ви знайшли в мальовничій околиці міста ПГТ велику ділянку землі. Її власник не зацікавлений у довготривалому володінні й готовий продати дешево.",
        33600, 24, 1400, 10
    ),
    23 to BoardCard.Chance.Land(
        "У живописному місці неподалік від міста продається ділянка землі. Як власник зазначає, він не планує жити в Україні й тому продає за символічну ціну.",
        12000, 15, 800, 10
    ),
    24 to BoardCard.Chance.Land(
        "У селищі міського типу неподалік від міста бідна сім’я продає свій сертифікат на 20 соток землі. Квартиру вони вже продали, щоб погасити кредит і знайти кращу роботу. Землю можна придбати за дуже привабливою ціною.",
        20000, 20, 1000, 10
    ),
    25 to BoardCard.Chance.Land(
        "Вам вдалося налагодити дружні стосунки з головою сільради і директором колгоспу. Тепер ніхто ніколи не згадає, що раніше ви виділили чужу ділянку землі.",
        43200, 36, 1200, 10
    ),
    26 to BoardCard.Chance.Land(
        "У ПГТ неподалік від міста продається сертифікат на 20 соток землі, щоб переїхати в місто і відкрити власний бізнес.",
        22000, 20, 1100, 10
    ),
    27 to BoardCard.Chance.Land(
        "За 5 км від міста почалося будівництво нового котеджного містечка. Земля навколо зростає в ціні, як і ціни на нерухомість.",
        3600, 6, 600, 10
    ),
    28 to BoardCard.Chance.Land(
        "В селах розширення границь міста частина земель сільськогосподарського призначення буде віддана під забудову. У цьому районі якраз продається хороший шмат землі.",
        75000, 50, 1500, 10
    ),
    29 to BoardCard.Chance.Land(
        "Є шанс купити чудовий клаптик землі, примикаючий до території заповідника. Наразі там будівництво заборонене. Але можна трохи почекати — земля в дуже мальовничій місці.",
        24000, 24, 1000, 10
    ),
    30 to BoardCard.Chance.Land(
        "У центрі міста живе старенький, у якого вже немає спадкоємців. Пропонується переселити його в благоустроєну однокімнатну квартиру в обмін на земельну ділянку.",
        80000, 40, 2000, 10
    ),
    31 to BoardCard.Chance.Land(
        "Велика угода! Є можливість купити величезну земельну ділянку площею 60 соток недалеко від міста за зниженою ціною. Район активно забудовується.",
        72000, 60, 1200, 10
    ),
    32 to BoardCard.Chance.Land(
        "Бідна сім’я недалеко від міста виставляє на продаж земельну ділянку на 40 соток. Вони пропонують вам розбити її на 4 частини і продати по 10 соток. Це покращить їхнє становище і принесе вам прибуток.",
        5500, 10, 550, 10
    ),
    36 to BoardCard.Chance.Shares(
        description = "Компанія Terr Oil провела геологічну розвідку й виявила поклади нафти. Держава виставляє на продаж акції компанії. Ви можете придбати частину й отримувати прибуток у майбутньому.",
        price = 100,
        maxShares = 1000,
        sharesType = SharesType.TO
    ),
    37 to BoardCard.Chance.Shares(
        description = "Волинське родовище бурштину дало офіційний дозвіл на видобуток. Акції компанії доступні для купівлі. Попит стабільний, прибутки високі.",
        price = 200,
        maxShares = 2000,
        sharesType = SharesType.GS
    ),
    38 to BoardCard.Chance.Shares(
        description = "Компанія Terr Oil отримала від уряду України ліцензію на розробку нафтових родовищ в акваторії Азовського моря. Для реалізації цього проєкту потрібні інвестиції. Ви можете стати учасником і придбати акції. Очікується зростання ціни на нафту, що робить це вкладення особливо привабливим.",
        price = 50,
        maxShares = 500,
        sharesType = SharesType.TO
    ),
    39 to BoardCard.Chance.Shares(
        description = "Після «помаранчевої революції» відносини України й Росії загострилися, ціна на російський газ зросла у 2,5 раза. Компанія Шебелинка-ГазПром різко збільшила обсяги видобутку й стала надзвичайно привабливою для інвесторів.",
        price = 300,
        maxShares = 3000,
        sharesType = SharesType.ShchHP
    ),
    40 to BoardCard.Chance.Shares(
        description = "Після початку видобутку нафти в Чорному морі уряд вирішив підтримати бізнес у цій сфері. Компанія Terr Oil терміново залучає інвестиції для розвитку інфраструктури.",
        price = 500,
        maxShares = 5000,
        sharesType = SharesType.TO
    ),
    41 to BoardCard.Chance.Shares(
        description = "Місцезнаходження газу в Полтавській області вже освоєне і успішно розробляється. Однак зацікавлені особи в Кабінеті Міністрів лобіюють перенесення виробництва газу з ділянки компанії «РосУкрЕнерго». Через це акції компанії «Шебелинка-ГазПром» падають. Але держава планує збільшити обсяги видобутку газу, що приваблює нових інвесторів.",
        price = 50,
        maxShares = 500,
        sharesType = SharesType.ShchHP
    ),
    42 to BoardCard.Chance.Shares(
        description = "Після впровадження нових технологій глибокої очистки ефективність добування золота зросла. Тепер із 10 тонн породи видобувається 30 грам золота! Тепер робота шахт стала прибутковою. Ви можете придбати акції місцевої компанії Global Capital з перспективою великих прибутків!",
        price = 500,
        maxShares = 5000,
        sharesType = SharesType.GS
    ),
    43 to BoardCard.Chance.Shares(
        description = "Проведення геолого-розвідувальних робіт у Волинській області підтвердило наявність значних запасів золота. Але спосіб видобутку ще не визначений. Колосальні кошти підуть на розробку. Ви можете придбати акції компанії.",
        price = 100,
        maxShares = 1000,
        sharesType = SharesType.GS
    ),
    44 to BoardCard.Chance.Shares(
        description = "Компанія Terr Oil планує розширити свої операції в нових регіонах. Для цього потрібно залучити додаткові інвестиції.",
        price = 200,
        maxShares = 2000,
        sharesType = SharesType.TO
    ),
    45 to BoardCard.Chance.Shares(
        description = "Після введення нового стандарту CDMA структура ринку практично не змінилася. Стандарт використовується паралельно з GSM, але компанії CST інвестують у розвиток станцій і розширення зони покриття.",
        price = 250,
        maxShares = 2500,
        sharesType = SharesType.CST
    ),
    46 to BoardCard.Chance.Shares(
        description = "Після розширення зони покриття стандарт CDMA став дуже популярним. Попит на послуги зростає, оператори мобільного зв’язку розширюють мережу. Компанія CST збільшує інвестиції.",
        price = 500,
        maxShares = 5000,
        sharesType = SharesType.CST
    ),
    47 to BoardCard.Chance.Shares(
        description = "Незважаючи на лобіювання своїх інтересів у Верховній Раді, компанія CST змогла залучити інвестиції для впровадження нових стандартів мобільного зв’язку.",
        price = 50,
        maxShares = 500,
        sharesType = SharesType.CST
    ),
    48 to BoardCard.Chance.Shares(
        description = "Після офіційного оголошення намірів України приєднатися до НАТО інвестиції в оборонний сектор різко зросли. Компанія, що співпрацює з «УкрОборонПромом», випускає акції для розширення виробництва.",
        price = 500,
        maxShares = 5000,
        sharesType = SharesType.CST
    ),
    49 to BoardCard.Chance.Shares(
        description = "Компанія CST планує перейти на новий стандарт зв’язку. Для цього потрібно інвестувати в обладнання та розширення мережі.",
        price = 100,
        maxShares = 1000,
        sharesType = SharesType.CST
    ),
    50 to BoardCard.Chance.Shares(
        description = "У Полтавській області виявлено великі родовища природного газу. Держава залучає приватні інвестиції. Компанія «ШебелинкаГазПром» випускає акції для розширення видобутку.",
        price = 100,
        maxShares = 1000,
        sharesType = SharesType.ShchHP
    ),
    51 to BoardCard.Chance.Shares(
        description = "У Волинській області знайдено родовища золота. Держава не має коштів для розробки. Геологорозвідувальні роботи потребують великих вкладень, і приватні інвестори заходять у проєкт.",
        price = 100,
        maxShares = 1000,
        sharesType = SharesType.GS
    ),
    52 to BoardCard.Chance.Estate(
        description = "Ваш сусід продає величезну дачу під Києвом. Колись він служив у лавах Радянської армії, а саму дачу безкоштовно отримав як призовник, відпрацювавши свою «чергу».",
        price = 50000
    ),
    53 to BoardCard.Chance.Estate(
        description = "Ваш дідусь продає свою дачу під Києвом. Він планує переїхати до родичів і не має наміру займатися продажем довго, тому готовий віддати будинок за дуже низькою ціною.",
        price = 20000
    ),
    54 to BoardCard.Chance.Estate(
        description = "Ваш заможний сусід (колишній партійний працівник) продає старий будинок. Гроші йому потрібні терміново, а займатися продажем він не хоче, тому погоджується на мінімальну ціну.",
        price = 55000
    ),
    55 to BoardCard.Chance.Estate(
        description = "Ви натрапили на оголошення про продаж добротного заміського будинку за 20 км від траси Київ–Львів. Поруч ліс і річка — надзвичайно вигідна пропозиція.",
        price = 30000
    ),
    56 to BoardCard.Chance.Estate(
        description = "Ваша бабуся померла і залишила вам і вашому брату в спадок будинок у селі. Якщо ви віддасте брату його частку грошима, будинок залишиться вам, і ви зможете його відреставрувати та вигідно продати.",
        price = 10000
    ),
    57 to BoardCard.Chance.Estate(
        description = "У вас є можливість купити приватний будинок у передмісті Києва з чудовим видом, який давно не використовується. Спочатку власник намагався здавати його в оренду, а тепер продає.",
        price = 45000
    ),
    58 to BoardCard.Chance.Estate(
        description = "Ви побачили в газеті оголошення про продаж капітального будинку за 15 км від Києва, у лісі та неподалік траси. За таке розташування — дуже вигідна ціна. Але покупців поки що немає.",
        price = 15000
    ),
    59 to BoardCard.Chance.Estate(
        description = "Ваш сусід по гаражу продає свою дачу під Києвом. Ви не раз бували там разом, тому знаєте, що дача у хорошому стані. Він не “заморочується” з продажем і ставить привабливу ціну.",
        price = 40000
    ),
    60 to BoardCard.Chance.Estate(
        description = "Ви побачили в газеті оголошення про продаж дачного будинку з городом. Будинок добротний, доглянутий і придатний для проживання протягом усього року.",
        price = 25000
    )
)